# Item Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ReferenceArrayArray..::..Item Property
ReferenceArrayArray Class See Also
---
Gets or sets a ReferenceArray at a specified index within the array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual ReferenceArray this[
	int index
] { get; set; }
```

Visual Basic
---
```text
Public Overridable Property Item ( _
	index As Integer _
) As ReferenceArray
	Get
	Set
```

Visual C++
---
```text
public:
virtual property ReferenceArray^ Item[int index] {
	ReferenceArray^ get (int index);
	void set (int index, ReferenceArray^ value);
}
```

# ### Parameters
index
    Type: System..::..Int32The index of the ReferenceArray to be set or retrieved.
# ### Return Value
Returns the ReferenceArray at the specified index.
# See Also
ReferenceArrayArray Class
Autodesk.Revit.DB Namespace